/* 可用填充函数的初始化文件 */

INSERT INTO public.fills_generaterule (id,created_at,updated_at,rule_name,function_name,fill_order,description) VALUES
	 (4882843648000,'2023-06-28 21:34:10.250237+08','2023-06-28 21:34:10.250237+08','time_serial_iter','time_serial_iter',1,'日期时间字符串'),
	 (4883453444096,'2023-06-28 21:35:24.688104+08','2023-06-28 21:35:24.688104+08','value_list_iter','value_list_iter',2,'字符串数组'),
	 (4884580073472,'2023-06-28 21:37:42.216547+08','2023-06-28 21:41:00.693467+08','associated_fill','associated_fill',2,'特定数据集'),
	 (4878393573376,'2023-06-28 21:25:07.029875+08','2023-06-28 21:41:14.549457+08','fixed_value_iter','fixed_value_iter',1,'单个固定数据'),
	 (4880372080640,'2023-06-28 21:29:08.54572+08','2023-06-28 21:41:25.183687+08','random_number_iter','random_number_iter',1,'范围随机数值'),
	 (4897600479232,'2023-06-28 22:04:11.622607+08','2023-06-28 22:04:11.622607+08','calculate_expressions','calculate_expressions',3,'数值计算'),
	 (4898068365312,'2023-06-28 22:05:08.737051+08','2023-06-28 22:05:08.737051+08','join_string','join_string',4,'固定字符拼接多个值');

INSERT INTO public.fills_generateruleparameter (id,created_at,updated_at,name,data_type,description,required,default_value,need_outside_data,rule_id) VALUES
	 (4878639841280,'2023-06-28 21:25:37.114913+08','2023-06-28 21:25:37.114913+08','value','string','固定值',true,'string',false,4878393573376),
	 (4880863305728,'2023-06-28 21:30:08.539895+08','2023-06-28 21:30:08.539895+08','start','number','起始值',false,'1',false,4880372080640),
	 (4881075896320,'2023-06-28 21:30:34.488701+08','2023-06-28 21:30:34.488701+08','stop','number','结束值',false,'42',false,4880372080640),
	 (4881783652352,'2023-06-28 21:32:00.881345+08','2023-06-28 21:32:00.881345+08','is_decimal','boolean','是否包含小数',false,'false',false,4880372080640),
	 (4881930936320,'2023-06-28 21:32:18.860503+08','2023-06-28 21:33:01.482113+08','ndigits','number','小数位数',false,'2',false,4880372080640),
	 (4883106578432,'2023-06-28 21:34:42.3718+08','2023-06-28 21:34:42.3718+08','repeat','number','每个时间字符串的重复次数',false,'1',false,4882843648000);
